Revit 2026 API

# NoiseNoiseType Property

---

The property labeled "Noise Type" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string NoiseType { get; }
```
```vb
Public Shared ReadOnly Property NoiseType As String
	Get
```
```cpp
public:
static property String^ NoiseType {
	String^ get ();
}
```
```fsharp
static member NoiseType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "NoiseType".

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace